<?php

namespace Metal\CategoriesBundle\Helper;

use Brouzie\Bundle\HelpersBundle\Helper\HelperAbstract;

class FindCategoriesHelper extends HelperAbstract
{
    private $beginString = '(?:^|[\s.,;]|ст\.?\s?-?)';
    private $endString = '(?:[\s;,.]|$)';

    public function getStroySynonim()
    {
        return $arrStroySynonim = array(
            1126=>"песок",
            1127=>"щебень",
            1152=>"блок",
            1172=>"брусчатк",
            1176=>"кирпич"
        );
    }

    public function getSynonim()
    {
        return $arrSynonim = array(
            615 => 'лигатур',
            1121 => "рутил|Рутиловый",
            998 => '(?:\s|^)станок|(?:\s|^)станки',
            961 => "(?:^|\s)висмут|ВИ-?[12345]",
            41 => 'шпунт лар',
            160 => '(?:\s|^)бабб?ит|'.$this->beginString.'БНн'.$this->endString,
            161 => '(?:\s|^)бар(?:ий|ии|иев)',
            162 => 'берил{1,2}(?:ий|\s|\.|иев)',
            163 => '(?:\s|^)ванад(?:ий|\s|\.|иев)|ВнМ-?0|ВнПл-?1|ВнПр-?1',
            164 => '(?:\s|^)гаф(?:ний|\s|\.|ниев|н)|(?:\s|^)ГФИ',
            165 => '(\s|^)инди(?:й|\s|\.|ев)',
            166 => 'кадм(?:ий|\s|\.|иев)|КДО',
            167 => 'кальц(?:ий|\s|\.|иев)',
            168 => '(?:\s|^)магн(?:ий|\s|\.|иев)',
            169 => '(?:\s|^)мед[ьн](?:\s|\.|ая|ый|ые)|(?:\s|^)(?:АМФ|МНЖ|мнмц|ПМФОЦр)|(?:\s|^)м[1](?:\s|$)|[^\d](?:\s|^)мdd[мт](?:\s|$)|Константант|CU-DHP|Копель|(?:\s|^)М3р|(?:\s|^)М1[лр]м?([\s,;]|$)?'.$this->endString.'|'.$this->beginString.'МН?[12]'.$this->endString.'|Труба М2|'.$this->beginString.'М1м'.$this->endString.'|'.$this->beginString.'(МН10|МНА|М1тв?|М1м|М2м|М3тв?)'.$this->endString,
            170 => 'натр(?:ий|\s|\.|иев)',
            171 => '(?:\s|^)олов(?:ян|\s|\.|о)|(?:\s|^)ПОС[-\s]?\d|(?:[\s.,]|^)о1(?:пч)?(?:\s|$)',
            758 => 'Припо[ий]',
            173 => '(?:\s|^|-)рен(?:и[яй]|\s|\.|иев)',
            174 => 'рубид(?:ий|\s|\.|иев)',
            175 => 'свин(?:ец|\s|\.|ц)|Чушка С[123]|9559-?(?:89|90)',
            176 => 'тантал(?:\s|\.|ов|а|-)|(?:\s|^)ТВЧ(?:$|\s)',
            177 => '(?:\s|^)тит(?:ан'.$this->endString.'|\s|\.|анов)|(?:\s|^)(?:ВТ-?\s?\d|ПТ[-\s]?\d|ПТ-?7М|сп-?19|тс-?6|ПТ-?\dМ|СПТ-\d+?|(?:\s|^)ti(?:\s|$))|'.$this->beginString.'ОТ4-?1?'.$this->endString.'|'.$this->beginString.'ОТ4'.$this->endString.'|Плита 5В',
            153 => '(?:\s|^)(?:вольф|внж|ВР-?2[07]|ВА\s?-?1-(?:ЛН|ТО)|48-19-27|48-19-39|19671-91)|(?:[\s.,]|^)В[л](?:\s|$)|wt\s?\d|(?:[\s.,]|^)ЭВИ(?:\s|$)',
            179 => '(\s|^)ит(?:рий|трий|\s|\.|триев|риев)',
            180 => 'сканд(?:ий|\s|\.|иев)',
            181 => 'лантан(?:оид|\s|\.|ов)',
            182 => '(?:\s|^)цирк(?:он|\s|\.|иев)',
            183 => '(?:\s|^)зол(?:ото'.$this->endString.'|\s|\.)',
            185 => '(?:\s|^)осм(?:ий|\.|иев)',
            186 => 'платин(?:\s|\.|ов|а)',
            217 => 'бронз(?:\s|\.|ов)?|бра\d?ж|БрБ|БрК|БрХ|БрОЦ|БрОФ|БрАМ(?:\s|$)|БрЦр|БрМ|БрА9Ж4|1628-78|БрКМц|1208-2006|10025-78|БрОЦС\s?5-?5-?5|493-79|613-79|'.$this->beginString.'Бр-?[21]'.$this->endString.'|Бр05Ц5С5|БрХЦр|БрНБТ',
            218 => 'латун(?:[ьн]|\s|\.|иев|ный)|(?:\s|^)л[-сc]+?-?\d+?|лжмц59|лмц58|Чушка Л[СК]|Л63|Л68|Л90|ЛК75|Л70|ЛЖМЦ|ЛО6[02]|Л75мк|15Б1П|15Б3Р|1Б1Р|(?:[\s.,]|^)ЛС\s?59-1|ЛМЦ\s?58|(?:[\s.,]|^)ЛОК(?:\s|$)|л6[83](?:\s|$)|ОЦС\s?5-?5-?5|'.$this->beginString.'ЛМЦ'.$this->endString,
            219 => '(?:\s|^)никел(?:ь|\s|\.|и?евы)|НПА|13083-77|НП1|НП2|НП2Э|НМЖМц|МНЦ15',
            178 => '(?:\s|^)цинк(?:ов|[\s,]|\.|$)|ЦАМ4-?[12345]|(?:\s|^)ЦО(?:$|\s)|ЭОЦПп|Ц-0А|ЦАМ9',
            157 => 'ниоб(?:ий|\s|\.|иев|ия)|НБП-?\s?[123]|НБШ-?\s?[012]|Нб-?1Пл',
            152 => '(?:\s|^)молибден(?:\s|\.|ов)|48-19-286-78|(?:\s|^)МПЧ(?:$|\s)|(?:\s|^)МЧ(?:$|\s)|(?:\s|^)МШЧ(?:$|\s)|ДМИ-7',
            158 => '(?:\s|^)хром(?:а|овы|\s|\.)',
            983 => "(?:^|\s)силумин",
            979 => "(?:^|\s)(?:дюрал|д1т|д1\s?[96]|Д1АТ|23786-79|18475-82|ВД1АН|д1(?:[\s\*]|$))|ЧАМВ",
            159 => "(?:^|\s)ал(?:юм|\s|[,.]+)|(?:^|\s)ааааад\d{1,2}|1105А[МНТ]|21631-76" .
                "|(?:^|\s)а[5](?:$|[\s,.])|(?:(?:^|[.,\s])амг|амц)|(?:\s|^)а[дк]-?[\sо\d]+|" .
                "(?:\s|^)ав[\s]+|вад\d|пап\d|(?:^|\s)ак[4567891]|(?:^|\s)(?:ат)\d?(?:$|\s)|(?:^|\s)АД(?:$|[\s,.])|" .
                "ВД\s?1АН|(?:^|\s)В9[356]|7075Т651|(?:^|\s)1561|(?:^|\s)5754|1-92063-77|17232-99|1-92001-90|" .
                "1201Т1|(?:^|\s)1915|(?:^|\s)1980|(?:^|\s)2024Т|6061Т6|6082Т|(?:^|\s)АВ[РПТ]?(?:[\s]|$)|21488-97|(?:^|\s)АКЛП|(?:^|\s)АВЕ|"
                . "(?:^|\s)1[01]05|(?:^|\s)1163|(?:^|\s)1201(?:$|\s)|(?:^|\s)1915|(?:^|\s)7075|(?:^|\s)5[27]5[14]|(?:^|\s)А[0567][МН]|AW[-\s]?(?:50|60)|(?:^|\s)8011(?:[\s]|$)|"
                . "(?:[\s]|$)ПА[ДЖД]|6058|224366138-006-2006|(?:[\s]|^)В48|вд1(?:НР)?(?:[\s]|$)|(?:[\s]|^)д1н(?:[\s]|$)|(?:[\s]|^)а\s?85|(?:[\s]|^)а\s?7(?:[\s]|$)|АВПП|В65|'.$this->beginString.'[Аa][Ll]'.$this->endString.'|ВД1АМ",
            980 => "мельхиор|МН-?19",
            981 => "(?:^|\s)монел(?:[ь]|ев)|НМ-40А",
            982 => "(?:^|\s)нейзил|мнц",
            984 => "(?:^|\s)стерлинг",
            739 => "(?:^|\s)нихром|(?:^|\s)Х15Н60|Х20Н80",
            975 => "кремний",
            184 => 'серебр(?:янн?[ыа]|[оа])',
            704 => "заготовк",
            1001 => "перфорирование|перфораци[яю]",
            1036 => "сурьма"
        );
    }

    public function getExeption(){
        return $arrExeption = array(
            219 => array("(?:^|\s)нерж", "кран", "тро[ий]ник"),
            184 => array("(?:^|\s)алюм", "(?:^|\s)нерж", "(?:^|\s)круг(?:[,.;\s]|$)","панель", "уголок"),
            169 => array("(?:^|\s)балк", "3.2м2ф", "3Х3М2ФС", "контейнер", "трос", "изоляци", "Емкост", "бак", "Резервуар"),
            159 => array("3Х2М2Ф", "3Х3М2ФС", "арматур", "Грунтовка", "Насос", "электродвигател"),
            1121 => array("Электроды|Электр\."),
            1152 => array("питани", "управлен", "сигнал"),
            183 => array("черепиц"),
            );
    }

    public function getBranch()
    {
        return $arrBranch = array(
            1176 => array(
                1177 => "керамич",
                1178 => "силикат",
                1179 => "гипер\s?прес",
                1180 => "кисло",
                1181 => "клинкер",
                1182 => "огнеуп|шамот",
                1183 => "битый|(?:^|\s)бой"
            ),
            1172 => array(1175 => "гранит", 1174 => "габб?ро", 1173 => "базальт"),
            1152 => array(
                1169 => "керамзитобетон",
                1168 => "ячеист",
                1167 => "фибропенобет",
                1166 => "полистиролбетон",
                1165 => "пескобетон|пескобл",
                1164 => "пескоцем",
                1163 => "пенобетон|пенобло",
                1162 => "гипс",
                1161 => "керамобетон",
                1160 => "керамич",
                1159 => "газосилик",
                1158 => "газопенн?обет",
                1157 => "газозолобет|твинблок",
                1156 => "газобетон",
                1155 => "вибропрес|шлакобл",
                1154 => "бетон",
                1153 => "арболит"
            ),
            1121 => array(1122 => "песок|песок"),
            704 => array(805 => "сляб", 804 => "круг(?:[\s.,и]|$)", 803 => "блюм|квадрат(?:[\s.,ын]|$)", 92 => "гайка"),
            980 => array(732 => "труб|Листы?|пруто?к", 886 => "лент[аы]", 985 => "полос(?:[\s.,ыа]|$)"),
            983 => array(986 => "чушк"),
            961 => array(962 => "чушк"),
            158 => array(1007 => "метал", 1367 => "шток", 1443 => "порошок", 1521 => "стружк", 1455 => "круг(?:[\s.,и]|$)"),
            160 => array(987 => "чушк"),
            159 => array(
                1416 => "шестигран|(?:^|\s)ШГ\.?(?:[\s.,]|$)|шгрк",
                1119 => "шлак",
                1104 => "опалубк",
                1029 => "д18",
                709 => "катанка",
                716 => "труб",
                710 => "квадрат(?:[\s.,ы]|$)",
                711 => "круг(?:[\s.,и]|$)",
                712 => "лент[аы]",
                713 => "лист(?:[\s.,ы]|$)",
                486 => "плит(?:[\s.,ыа]|$)",
                714 => "полос(?:[\s.,ыа]|$)",
                715 => "пр?офиль|проф\.",
                488 => "пруто?к",
                718 => "фольга",
                717 => "уголок",
                492 => "швелл?ер",
                491 => "шин[ыа]",
                762 => "проволо?ка",
                969 => "рулон",
                970 => "чушк",
                971 => "порошо?к|купорос",
                635 => "(?:^|\s)лом|отходы",
                1020 => "балк[аи]|(?:^|\s)тавр|двутавр",
                1037 => "кабел[ьи]",
                1021 => "панел[ьи]",
                1022 => "полособульб",
                1023 => "(?:^|\s)бокс",
                1024 => "пудра",
                1025 => "зажим",
                1026 => "сплав",
                1027 => "алюмель",
                1495 => "крупк",
                1496 => "гранул",
                1497 => "паста",
                1498 => "слито?к",
            ),
            979 => array(
                726 => "труб",
                720 => "квадрат(?:[\s.,ы]|$)",
                721 => "круг(?:[\s.,и]|$)",
                722 => "лент[аы]",
                723 => "лист(?:[\s.,ы]|$)",
                487 => "плит(?:[\s.,ыа]|$)",
                724 => "полос(?:[\s.,ыа]|$)",
                725 => "профил[ьи]",
                489 => "пруто?к",
                727 => "уголок",
                728 => "швелл?ер",
                861 => "шестигран|(?:^|\s)ШГ\.?(?:[\s.,]|$)|шгрк",
                1028 => "рулон",
                1029 => "проволо?ка"
            ),
            217 => array(
                846 => "труб",
                763 => "проволо?ка",
                840 => "круг(?:[\s.,и]|$)",
                841 => "лент[аы]",
                842 => "лист(?:[\s.,ы]|$)",
                843 => "плит(?:[\s.,ыа]|$)",
                844 => "полоса",
                845 => "пруто?к",
                847 => "шестигран",
                780 => "сетка",
                988 => "чушк",
                989 => "порошо?к|купорос",
                990 => "слито?к",
                1034 => 'Отливк|рафинир',
                1035 => "брус",
                785 => "втулк",
                1041 => "приварыш"
            ),
            163 => array(
                138 => "ферр?ован",
                859 => "шлак",
                840 => "круг(?:[\s.,и]|$)",
                848 => "лент[аы]",
                849 => "лист(?:[\s.,ы]|$)",
                850 => "плит(?:[\s.,ыа]|$)",
                851 => "полос(?:[\s.,ыа]|$)",
                852 => "пруто?к",
                764 => "проволо?ка",
                853 => "фольга",
                793 => "тигель"
            ),
            1126 => array(
                1105 => "сталь|металл",
                1122 => "рутил",
                1128 => "гранат",
                1129 => "доломит",
                1130 => "извест",
                1131 => "карьерн",
                1132 => "кварцев",
                1133 => "морск",
                1134 => "речн",
                1135 => "шлаков"
            ),
            1127 => array(
                1142 => "щпс|смесь",
                1141 => "шлак",
                1131 => "карьерн",
                1137 => "гранит",
                1138 => "доломит",
                1139 => "известь",
                1140 => "мрамор"
            ),
            153 => array(
                139 => "ферр?ово",
                797 => "контакт",
                854 => "лент[аы]",
                855 => "лист(?:[\s.,ы]|$)",
                856 => "плит(?:[\s.,ыа]|$)",
                765 => "проволо?ка",
                857 => "фольга",
                858 => "штабик",
                783 => "электрод",
                786 => "мишень",
                791 => "нагревател[ьи]",
                748 => "пруто?к",
                1039 => "порошо?к",
                1499 => "стружк"
            ),
            164 => array(
                859 => "лист(?:[\s.,ы]|$)",
                860 => "пруто?к",
                766 => "проволо?ка"
            ),
            166 => array(
                863 => "лист(?:[\s.,ы]|$)",
                862 => "анод"
            ),
            218 => array(
                991 => "чушк",
                870 => "труб",
                864 => "круг(?:[\s.,и]|$)",
                865 => "лент[аы]",
                866 => "лист(?:[\s.,ы]|$)",
                867 => "плит(?:[\s.,ыа]|$)",
                868 => "полос(?:[\s.,ыа]|$)",
                869 => "пруто?к",
                871 => "шестигран",
                767 => "проволо?ка",
                801 => "клапан|вентиль|15Б3Р|15Б1П|1Б1Р",
                800 => "кран",
                798 => "анкер",
                781 => "сетка",
                637 => "лом|отходы",
                1046 => "квадрат",
                1047 => "профиль",
                1048 => "слито?к",
                1049 => "уголок"
            ),
            168 => array(
                872 => "лист(?:[\s.,ы]|$)",
                873 => "плит(?:[\s.,ыа]|$)",
                874 => "пруто?к",
                768 => "проволо?ка",
                1501 => "чушк",
                1526 => "порошок",
                1527 => "слито?к",
                1528 => "круг",
            ),
            169 => array(
                1530 => "пудр",
                1529 => "квадрат",
                1437 => "порошок",
                1504 => "таблетк",
                1503 => "гранул",
                1502 => "слитк",
                1411 => "шестигран|(?:^|\s)ШГ\.?(?:[\s.,]|$)|шгрк",
                1410 => "чушк[аи]",
                1072 => "стружк",
                967 => "лигатур|фосфорист",
                882 => "труб",
                877 => "круг(?:[\s.,и]|$)",
                878 => "лент[аы]",
                879 => "лист(?:[\s.,ы]|$)",
                884 => "плит(?:[\s.,ыа]|$)",
                880 => "полос(?:[\s.,ыа]|$)",
                769 => "проволо?ка",
                881 => "пруто?к",
                729 => "фольга",
                883 => "шин[ыа]",
                1038 => "кабел[ьи]",
                875 => "анод",
                784 => "гвозд",
                876 => "катод",
                636 => "лом|отходы",
                779 => "сетка",
                799 => "зажим",
                759 => "провод",
                1015 => "профил[ьи]"
            ),
            732 => array(
                887 => "труб",
                886 => "лент[аы]"
            ),
            152 => array(
                1531 => "заготовк",
                1505 => "стружк",
                1078 => "жгут",
                1077 => "фольга",
                1076 => "труб[аын]",
                1075 => "пластин",
                1074 => "дисульф",
                1011 => "порошо?к",
                1014 => "концентр|212-?76",
                1013 => "оксид|окись",
                1012 => "метал",
                787 => "мишен[ьи]",
                888 => "квадрат",
                889 => "лент[аы]",
                890 => "лист(?:[\s.,ы]|$)",
                891 => "плит(?:[\s.,ыа]|$)",
                140 => "ферр?омолиб",
                892 => "пруто?к|круг(?:[\s.,и]|$)",
                893 => "штабик",
                770 => "проволо?ка",
                788 => "диск",
                790 => "лодоч",
                792 => "нагревател",
                794 => "тигель|тигли"
            ),
            733 => array(
                898 => "фольга",
                886 => "лент[аы]",
                894 => "круг(?:[\s.,и]|$)",
                895 => "лент[аы]",
                896 => "лист(?:[\s.,ы]|$)",
                897 => "полос(?:[\s.,ыа]|$)"
            ),
            734 => array(
                899 => "лент[аы]",
                900 => "полос(?:[\s.,ыа]|$)",
                771 => "проволо?ка"
            ),
            219 => array(
                150 => "ферр?оник",
                904 => "круг(?:[\s.,и]|$)",
                905 => "лент[аы]",
                906 => "лист(?:[\s.,ы]|$)",
                907 => "плит(?:[\s.,ыа]|$)",
                908 => "полос(?:[\s.,ыа]|$)",
                772 => "проволо?ка",
                910 => "пруто?к",
                901 => "анод",
                903 => "квадрат",
                909 => "профил[ьи]",
                782 => "сетка",
                902 => "катод",
                1478 => "труб[аы]",
                1508 => "гранул",
                1507 => "чушк",
                1506 => "слито?к",
                1532 => "фольг"
            ),
            157 => array(
                1407 => "сплав|добавка",
                1080 => "лист(?:[\s.,ы]|$)",
                1079 => "слито?к",
                914 => "труб",
                915 => "фольга",
                773 => "проволо?ка",
                789 => "диск",
                913 => "пруто?к",
                145 => "ферр?ониоб",
                911 => "лент[аы]",
                916 => "штабик",
                912 => "полос(?:[\s.,ыа]|$)",
                1008 => "порошо?к",
                1009 => "металл",
                1010 => "пятиокис|пентокс",
                1510 => "чипс",
                1509 => "стружк"
            ),
            739 => array(
                774 => "проволо?ка",
                917 => "лент[аы]",
                1070 => "труб[аы]"
            ),
            171 => array(
                795 => "припо[ий]",
                920 => "пруто?к|круг",
                919 => "лист(?:[\s.,ы]|$)",
                918 => "анод",
                1003 => "чушк",
                1512 => "слито?к",
                1511 => "гранул",
                1533 => "проволо?ка",
                1439 => "порошок",
                1534 => "электрод",
                1535 => "трубк?[аы]"
            ),
            173 => array(
                775 => "проволо?ка",
                922 => "фольг",
                921 => "пруто?к",
                924 => "штабик",
                923 => "полос(?:[\s.,ыа]|$)"
            ),
            175 => array(
                776 => "проволо?ка",
                926 => "круг(?:[\s.,и]|$)",
                925 => "анод",
                927 => "лист(?:[\s.,ы]|$)",
                635 => "(?:^|\s)лом|отходы",
                1004 => "чушк",
                1017 => "пломб[аы]",
                1051 => "порошок",
                1055 => "(?:^|\s)блоки?(?:[\s,.;]|$)",
                1056 => "дробь",
                1057 => "(?:^|\s)труб[аы.]",
                1091 => "шестигран",
                1092 => "пруто?к",
                1513 => "слито?к",
                1536 => "плита"
            ),
            176 => array(
                973 => "лист(?:[\s.,ы]|$)",
                974 => "пруто?к|круг",
                1081 => "проволо?ка",
                1082 => "лент[аы]",
                1083 => "фольга",
                1084 => "штабик",
                1086 => "стержн",
                1085 => "(?:^|\s)трубк?[аы.]",
                1087 => "порош",
                1088 => "чипсы",
                1089 => "таблетк",
                1090 => "мишен[ьи]",
                1515 => "стружк"
            ),
            177 => array(
                1097 => "кольц[ао]",
                1096 => "болт([\sы]|$)",
                1095 => "порошо?к",
                1094 => "электрод",
                1093 => "поковк|заготовк",
                1073 => "стружк",
                141 => "ферр?отит",
                938 => "[Тт]руб|Труб",
                931 => "круг(?:[\s.,и]|$)",
                932 => "лент[аы]",
                933 => "лист(?:[\s.,ы]|$)|карточк",
                934 => "плит(?:[\s.,ыа]|$)",
                935 => "полос(?:[\s.,ыа]|$)",
                777 => "проволо?ка",
                937 => "пруто?к",
                930 => "квадрат",
                929 => "катанк",
                928 => "анод",
                940 => "фольга",
                936 => "профил[ьи]",
                638 => "лом|отходы",
                942 => "шестигран",
                941 => "швелл?ер",
                939 => "уголо?к",
                1520 => "чушк[аи]",
                1510 => "сляб",
                1518 => "гранул",
                1517 => "слито?ки?",
                1515 => "[ий]одид",
                1538 => "губк"
            ),
            178 => array(
                694 => "прово?ло?ка",
                510 => "лента",
                695 => "сетка",
                701 => "га[йи]ка",
                699 => "болт(?:[\s.,ы]|$)",
                700 => "винт(?:[\s.,ы]|$)",
                507 => "рулон",
                1231 => "металлопрофил[ьи]",
                1230 => "Профил[ьи]",
                1103 => "Опалуб",
                1006 => "гранул",
                737 => "труб",
                778 => "проволо?ка",
                943 => "анод",
                944 => "лист(?:[\s.,ы]|$)",
                703 => "саморез",
                112 => "шуруп",
                207 => "цинкование",
                1019 => "литейн",
                1018 => "сплав|ЦАМ4-?[12345]",
                1005 => "чушк",
                1050 => "порошок",
                1522 => "пудра"
            ),
            981 => array(
                150 => "ферр?оник",
                894 => "круг(?:[\s.,и]|$)",
                895 => "лент[аы]",
                896 => "лист(?:[\s.,ы]|$)",
                897 => "полос(?:[\s.,ыа]|$)",
                898 => "фольга"
            ),
            982 => array(771 => "проволо?ка", 899 => "лент[аы]", 900 => "полос(?:[\s.,ыа]|$)"),
            758 => array(
                795 => "олов",
                796 => "медь",
                996 => "никел"
            ),
            182 => array(
                1525 => "порошо?к",
                1524 => "стружк",
                1542 => "лист",
                1523 => "[йи]одид",
                1541 => "фольга",
                1540 => "пруто?к|круг(?:[\s.,и]|$)",
                1543 => "полоса",
                1544 => "провол?к",

            ),
            184 => array(
                1514 => "порошок",
                1537 => "проволо?к"
            ),
        );
    }

    public function getMulti()
    {
        $arrMulti = array();

        $arrMulti[1]['search'] = "нерж(?:ав|\s|\.|,|$)|03Х12Н10|15Х25Т|08X18H|" .
            "20х23н19|aisi|07Х16Н6|[xх]18[HН](?:10|[9])|" .
            "(?:^|\s)(?:20|40)[xх]13(?:\s|$)|" .
            "(?:^|\s)(?:8|12|20|25|30|40|65)[xхх]13(?:\s|$)|(?:\s|^|ст[.\s]?)10[xх]17(?:\s|$)|" .
            "ЭП222|13Х11Н2В2М|95Х18Ш|08[xх]17Т1|14[xх]17[HН]2|Х13Н|Х18Н|" .
            "25Х13Н2|12Х18Н9|17Х18Н9|ХН65МВУ|ЭИ304|ЭИ962|" .
            "ЭП693ВД|ЭП718ИД|Х17[HН]13М2|ХН28МДТ|20Н14С2|12Х15Г9НД|" .
            "12Х21Н5Т|ХН32Т|08Х22Н6Т|08Х10Н20Т2|TP321|316Ti|06х19н9|12Х17|36НХТЮ|" .
            "08х20н9|0[45678]х(?:19|2[012345])[HН](?:1[0123]|[798])|ХН70ВТЮ|9Х13Н6ЛК4|06ХН28МДТ|09Х16Н4Б|07Х21Г7АН5|" .
            "12Х25Н16|15Х18Н12С4ТЮ|12Х21Н5Т|17[HН]13М2Т|09х16н4б|20Х17Н2|12Х17Г9АН4|14Х17Н10|ХН65МВ|30Х13|Н70МФ|15Х25Т|15Х18Н12С4ТЮ|ХН73МБТЮ|ХН73МБТЮ|" .
            "10Х17[HН]13М3Т|10Х17Н15М3Т|ХН56ВНТЮ|04Х14Н14В2М|14Х17Н2|20Х13|12Х13|12Х21Н5Т|06Х14Н6Д2МБТ|08Х15Н5Д2Т|25Х13Н2|10Х17Н13М2Т|" .
            "07Х25Н13|07Х25[HН]16АГ6Ц|ХН62ВМЮТ|нж-?13|35Х25Н20С2|ХН62ВМЮТВД|08Х17Н|08Х18Х12Т|гр.Б26|10Х12Н20Т2|08Х17Т|40Х13|08х18т1";
        $arrMulti[1]['variants'] = array(
            634 => "(металл?о?|(\s|^))лом(?:$|\s)|отходы",
            505 => "полос[аыуе.,\s]",
            27 => "заготовк",
            585 => "(?:^|\s)угол|(?:^|\s)углов",
            992 => "(?:^|\s)поковк",
            77 => "труб",
            458 => "лент",
            484 => "квадрат",
            493 => "(?:^|\s)круг|пруто?к",
            504 => "шестигр|шгрк",
            506 => "рулон",
            589 => "электрод[\sы]",
            588 => "прово?ло?к",
            508 => "штрипс",
            590 => "(?:^|\s)сетк",
            591 => "(?:^|\s)канат",
            592 => "(?:^|\s)цепь",
            593 => "кронште[йи]н",
            594 => "(?:^|\s)втулк",
            595 => "(?:^|\s)решетк",
            596 => "(?:^|\s)дроб",
            642 => "затвор",
            645 => "шпилька",
            647 => "заглушка",
            650 => "(?:^|\s)отвод",
            652 => "переходы?(?:$|\s)",
            651 => "тройник",
            664 => "опор[аы]",
            641 => "клапан|вентил[иь]",
            666 => "болт",
            667 => "винт(?:ы|$|\s)",
            639 => "задвижк",
            644 => "флане?ц",
            668 => "га[йи]ка",
            669 => "ша[йи]ба",
            671 => "саморез",
            681 => "коуш",
            1059 => "швелл?ер",
            1318 => "балка|тавр",
            1320 => "американ",
            53 => "лист|(?:^|\s)сталь(?:$|\s)"
        );

        $arrMulti[1]['default'] = 0;
        $arrMulti[2]['marks'] = "10Х15Н35В3ТЮ|ХН28ВМАБ|ХН32Т|ХН35ВТ|ХН35ВТР|ХН35ВТЮ|ХН38ВБ|ХН38ВТ|" .
            "ХН45Ю|ХН51ВМТЮКФР-ВД|ХН55ВМТКЮ|ХН55МВЮ|ХН56ВМКЮ|ХН56ВМТЮ|ХН57МТВЮ|ХН58ВМКЮР-ВД|ХН60ВТ|" .
            "ХН60МЮВТ-ВД|ХН60Ю|ХН62МВКЮ|ХН65ВМТЮ|ХН67МВТЮ|ХН70ВМТЮ|ХН70ВМТЮФ|ХН70ВМЮТ|" .
            "ХН70МВТЮБ|ХН70Ю|ХН75ВМЮ|ХН75МБТЮ|ХН77ТЮ|ХН77ТЮР|ХН77ТЮРУ|ХН78Т|ХН80ТБЮ|" .
            "12МХ|12Х1МФ|12Х2МФБ|12Х2МФСР|12ХМ|15Х1М1Ф|15Х2М2ФБС|15Х5|15Х5ВФ|15Х5М|15Х6СЮ|15ХМ|15ХМФКР|16ГНМ|" .
            "18Х3МВ|03Х18Н10Т|05Х18Н10Т|08Х15Н24В4ТР|08Х15Н25М3ТЮБ|08Х16Н11М3|08Х16Н13М2Б|08Х20Н14С2|" .
            "08Х21Н6М2Т|09Х14Н16Б|09Х14Н19В2БР|09Х14Н19В2БР1|09Х16Н15М3Б|09Х16Н16МВ2БР|10Х11Н20Т2Р|" .
            "10Х11Н20Т3Р|10Х11Н23Т3МР|10Х13СЮ|10Х15Н25В3ТЮ|10Х15Н25М3В3ТЮК|10Х18Н18Ю4Д|10Х23Н18|10Х25Н25ТР|" .
            "10Х7МВФБР|11Х11Н2В2МФ|12Х12МВФБР|12Х14Н14В2М|12Х25Н16Г7АР|12Х2МВ8ФБ|12Х8ВФ|13Х11Н2В2МФ|13Х14Н3В2ФР|" .
            "15Х11МФ|15Х12ВНМФ|" . "15Х18СЮ|" .
            "16Х11Н2В2МФ|" .
            "18Х11МНФБ|" .
            "18Х12ВМБФР|" .
            "20Х12ВНМФ|" .
            "20Х12Н2В2МФ|" .
            "20Х20Н14С2|" .
            "20Х23Н13|" .
            "20Х25Н20С2|" .
            "30Х13Н7С2|" .
            "31Х19Н9МВБТ|" .
            "36Х18Н25С2|" .
            "37Х12Н8Г8МФБ|" .
            "40Х10С2М|" .
            "40Х15Н7Г7Ф2МС|" .
            "40Х9С2|" .
            "45Х14Н14В2М|" .
            "45Х14НМВ2М|" .
            "45Х22Н4М3|" .
            "55Х20Г9АН4|" .
            "55Х20Г9АН4Б|" .
            "20Х1М1Ф1БР|" .
            "20Х1М1Ф1ТР|" .
            "20Х3МВФ|" .
            "20ХМФБР|" .
            "25Х1М1Ф|" .
            "25Х1МФ|" .
            "25Х2М1Ф|" .
            "30ХМ|" .
            "30ХМА|" .
            "38Х2МЮА";

        $arrMulti[2]['search'] = "жар(?:опр|ост|\s|\.)|" . $arrMulti[2]['marks'];

        $arrMulti[2]['variants'] = array(
            55 => "лист",
            1030 => "(?:^|\s)круг|пруто?к",
            1031 => "шестигр|шгрк",
            1032 => "лент",
            1033 => "прово?ло?к"
        );

        $arrMulti[2]['default'] = 0;

        $arrMulti[3]['search'] = "(?:^|\s|,)оц(?:инк|\s|\.|,)+?|ЛКПОЦ|DIN5686|DIN763|zn|цинк";

        $arrMulti[3]['variants'] = array(
            1367 => "шток",
            1228 => "шифер".$this->endString,
            1308 => "парапет.*забор",
            1306 => "планк.*забор",
            1304 => "кон[её].*забор",
            1300 => "отлив",
            1297 => "козыр[ёе]к",
            1295 => "нащельник",
            1293 => "капельник",
            1291 => "ендова",
            1289 => "снегозадержатель",
            1287 => "планка",
            1286 => "кон[её]к",
            1282 => "держатель ж[ёе]лоб",
            1278 => "водослив",
            1280 => "ж[ёе]лоб",
            1103 => "опалубк",
            1098 => "швеллер",
            994 => "трос(?:[\s.,ы]|$)",
            1068 => "флане?ц",
            993 => "электрод",
            79 => "труб",
            1419 => "полос",
            509 => "штрипс",
            510 => "лента",
            694 => "прово?ло?ка",
            695 => "сетка",
            1418 => "круг(?:[\s.,и]|$)|пруто?к",
            696 => "кронште[йи]н",
            697 => "канат",
            698 => "анкер(?:[\s.,ы]|$)",
            699 => "болт(?:[\s.,ы]|$)",
            700 => "винт(?:[\s.,ы]|$)",
            701 => "га[йи]ка",
            702 => "ша[йи]б[ыа]",
            703 => "[cс]аморез",
            1054 => "(?:^|\s)отвод(?:[\sы,.;]|$)",
            59 => "проф(?:н|лист)",
            507 => "рулон",
            47 => "[лЛ]ист|прокат|сталь(?:[,.\s]|$)",
            1150 => "воздуховод",
            1192 => "такелаж",
            1263 => "цепь",
            1329 => "ключ",
            1349 => "гровер",
            1353 => "гвозд[ьи]",
            1355 => "кнопка",
            1363 => "зацеп",
            1420 => "(?:^|\s)уголо?к"
        );
        $arrMulti[3]['default'] = 0;

        $arrMulti[6]['search'] = "(?:^|\s)[Тт]руб.{0,2}(?:[,.\s]|$)";
        $arrMulti[6]['variants'] = array(
            1486 => "хризотил",
            1485 => "стекло",
            1060 => "пластик|ПВХ|ПНД|(\s)пэ|пвд|(?:^|\s)п[абп](?:[;\s(.,])|ПЕКС|PEX",
            1464 => "изол|вус|пп[ум]",
            1063 => "металл?опласт",
            1484 => "керамич|муллит",
            1482 => "бетон",
            124 => "заглушк",
            121 => "переходник",
            117 => "вентиль",
            579 => "угольник",
            1062 => "(?:^|\s)восс?тановленн?а",
            65 => "(?:^|\s)б[-.\/]?у(?:[;\s(.,]|$)",
            87 => "\s?чуг|ЧНР|ВЧШГ",
            1040 => "воронка",
            1041 => "приварыш",
            1061 => "(?:^|\s)леж",
            1465 => "скорлупа",
            118 => "флане?ц",
            516 => "профиль",
            561 => "клинья",
            612 => "дымов",
            1415 => "креп[её]ж"
        );
        $arrMulti[6]['default'] = 516;
        $arrMulti[5]['search'] = "лист|толстолистовая";

        $arrMulti[5]['variants'] = array(
            475 => "(?:гк|г\.к|гор|г\/к)",
            475 => "(хк|х\.к|хол|х\/к)",
            55 => "(жар)",
            475 => "(перф)",
            475 => "(рифл)"
        );
        $arrMulti[5]['default'] = 0;
        $arrMulti[4]['search'] = "(?:^|\s)рубка(?:$|\s)";
        $arrMulti[4]['variants'] = array(209 => "[а-яё]?");
        $arrMulti[4]['default'] = 0;

        $arrMulti[7]['search'] = "чуг(?:ун|[.,;\s]|$)|ЧС-?3".$this->endString;
        $arrMulti[7]['variants'] = array(
            1301 => "отливк[аи]",
            1193 => "чушка",
            95 => "(?:^|\s)дроб[ьи]",
            628 => "(?:^|\s)люк",
            818 => "плит[аы]?(?:[,.\s]|$)|поверочн",
            820 => "патруб(?:ок|ки)",
            821 => "раструб",
            822 => "колено",
            823 => "отвод",
            825 => "тро[йи]ник",
            826 => "крестовина|крест".$this->endString,
            827 => "муфта",
            828 => "ревизия",
            829 => "заглушка",
            830 => "прочистка",
            831 => "футорка",
            832 => "затвор",
            833 => "задвижка",
            834 => "угольник",
            835 => "контакт",
            836 => "выпуск",
            837 => "переход",
            838 => "седелка",
            839 => "подставка",
            626 => "лите[йи]н",
            627 => "(?:^|\s)круг",
            814 => "дождепри",
            815 => "кронште[йи]н",
            816 => "радиатор",
            817 => "ван?а",
            819 => "фасонные",
            632 => "лом|отходы",
            1319 => "американ"
        );
        $arrMulti[7]['default'] = 624;

        $arrMulti[8]['search'] = "арматур";
        $arrMulti[8]['variants'] = array(
            1064 => "АКС|композит|стекло|пластик|базальт",
            583 => "фиксатор",
            98 => "канат",
            103 => "сетка",
            1041 => "приварыш"
        );
        $arrMulti[8]['default'] = 7;


        $arrMulti[9]['search'] = "задвижк[аи]";
        $arrMulti[9]['variants'] = array(
            1052 => "сталь",
            562 => "устьев"
        );
        $arrMulti[9]['default'] = 125;

        $arrMulti[10]['search'] = "стальн?";
        $arrMulti[10]['variants'] = array(
            1053 => "отвод",
            1069 => "муфт[ыа]",
            1195 => "плит[аы]?(?:[,.\s]|$)"
        );
        $arrMulti[10]['default'] = 0;

        $arrMulti[11]['search'] = "штуцер";
        $arrMulti[11]['variants'] = array(
            128 => "кран|Кран",
            131 => "клапан|вентиль"
        );
        $arrMulti[11]['default'] = 0;

        $arrMulti[12]['search'] = "опалубк";
        $arrMulti[12]['variants'] = array(
            1117 => "консоль",
            1116 => "подкос",
            1115 => "замок",
            1114 => "захват",
            1110 => "щит-?\s?к",
            1109 => "армоцемент",
            1107 => "дерев",
            1108 => "железоб"
        );
        $arrMulti[12]['default'] = 0;

        $arrMulti[13]['search'] = "электрод|электр\.";
        $arrMulti[13]['variants'] = array();
        $arrMulti[13]['default'] = 0;

        $arrMulti[14]['search'] = "железо\s?-?бет|(?:^|\s)жб|(?:^|\s)кп|(?:^|\s)пкж";
        $arrMulti[14]['variants'] = array(
            1275 => "ригел",
            1186 => "ферм[аы]",
            1187 => "колонн?[ыа]",
            1188 => "плит[аы]",
            1238 => "реш[её]тк[иа]",
            1237 => "полушпал[аы]",
            1234 => "шпал[аы]"
        );

        $arrMulti[14]['default'] = 0;

        return $arrMulti;
    }
}